## **Data Analysis**

#### **Importing Libraries**

In [23]:
import pandas as pd

#### **Data Reading**

In [21]:
df_sio = pd.read_csv('data/scripps_pier_20151110.csv')

#### **Data Analysis**

In [22]:
df_sio.head()

              Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0  11/10/2015 1:42      22.307        3.712     33.199     19.95
1  11/10/2015 1:35      22.311        3.588     33.201     19.94
2  11/10/2015 1:29      22.305        3.541     33.200     19.95
3  11/10/2015 1:23      22.323        3.463     33.200     19.95
4  11/10/2015 1:17      22.316        3.471     33.199     19.95

DATAFRAME -> DataType from pandas to work with a datasets and files in python

In [26]:
type(df_sio)
# crated datafame which is object of pandas.core which means you can use pandas methods on that dataframe

pandas.core.frame.DataFrame

In [24]:
# 
df_sio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         66 non-null     object
 1   chl (ug/L)   64 non-null     float64
 2   pres (dbar)  64 non-null     float64
 3   sal (PSU)    65 non-null     float64
 4   temp (C)     64 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.7+ KB

In [27]:
df_sio.describe()

       chl (ug/L)  pres (dbar)  sal (PSU)   temp (C)
count   64.000000    64.000000  65.000000  64.000000
mean    22.348484     3.046359  33.199400  20.069844
std      0.038389     0.256701   0.004952   0.067506
min     22.305000     2.714000  33.184000  19.940000
25%     22.318750     2.812000  33.197000  20.040000
50%     22.332500     3.012000  33.199000  20.070000
75%     22.381000     3.217750  33.203000  20.110000
max     22.423000     3.712000  33.206000  20.190000

In [28]:
# check duplicate values from df
df_sio.duplicated().sum()

np.int64(0)

In [31]:
# check shape
df_sio.shape

(66, 5)

#### **Data Transformation**

In [32]:
df_sio.head()

              Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0  11/10/2015 1:42      22.307        3.712     33.199     19.95
1  11/10/2015 1:35      22.311        3.588     33.201     19.94
2  11/10/2015 1:29      22.305        3.541     33.200     19.95
3  11/10/2015 1:23      22.323        3.463     33.200     19.95
4  11/10/2015 1:17      22.316        3.471     33.199     19.95

In [37]:
df_sio['Date'] = pd.to_datetime(df_sio['Date'], dayfirst=True)

In [39]:
df_sio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         66 non-null     datetime64[ns]
 1   chl (ug/L)   64 non-null     float64
 2   pres (dbar)  64 non-null     float64
 3   sal (PSU)    65 non-null     float64
 4   temp (C)     64 non-null     float64
dtypes: datetime64[ns](1), float64(4)
memory usage: 2.7 KB

In [40]:
df_sio['Date Only'] = df_sio['Date'].dt.date

In [41]:
df_sio.head()

,Date,chl (ug/L),pres (dbar),sal (PSU),temp (C),Date Only
0,2015-10-11 01:42:00,22.307,3.712,33.199,19.95,2015-10-11
1,2015-10-11 01:35:00,22.311,3.588,33.201,19.94,2015-10-11
2,2015-10-11 01:29:00,22.305,3.541,33.200,19.95,2015-10-11
3,2015-10-11 01:23:00,22.323,3.463,33.200,19.95,2015-10-11
4,2015-10-11 01:17:00,22.316,3.471,33.199,19.95,2015-10-11

In [42]:
df_sio['Time Only'] = df_sio['Date'].dt.time

In [43]:
df_sio.head()

,Date,chl (ug/L),pres (dbar),sal (PSU),temp (C),Date Only,Time Only
0,2015-10-11 01:42:00,22.307,3.712,33.199,19.95,2015-10-11,01:42:00
1,2015-10-11 01:35:00,22.311,3.588,33.201,19.94,2015-10-11,01:35:00
2,2015-10-11 01:29:00,22.305,3.541,33.200,19.95,2015-10-11,01:29:00
3,2015-10-11 01:23:00,22.323,3.463,33.200,19.95,2015-10-11,01:23:00
4,2015-10-11 01:17:00,22.316,3.471,33.199,19.95,2015-10-11,01:17:00